index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-21 Sat 08:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Minecraft Server</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Minecraft Server</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfd7d4b2">1. To Join</a></li>
<li><a href="#orgd3fa996">2. Mods</a>
<ul>
<li><a href="#org3f1221b">2.1. Client Only</a></li>
<li><a href="#org96f5666">2.2. Server Only</a></li>
<li><a href="#orgcc9e07c">2.3. Both</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Hi, this is the homepage for my little minecraft server!
</p>

<p>
It's effectively vanilla (it can be connected to with vanilla clients
just fine), but if you like I've got a little modpack consisting of
Litematica and Carpet Mod, plus some optimizations and QoL mods,
that'll give you a little extra functionality (see <a href="#orgd3fa996">2</a> for more
details).
</p>

<div id="outline-container-orgfd7d4b2" class="outline-2">
<h2 id="orgfd7d4b2"><span class="section-number-2">1</span> To Join</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>mc.pea.sh</code> is a whitelisted server just for me and my
friends/girlfriends, so if you don't know me, you probably can't
join.
</p>

<p>
If you do know me and you want to be added to the whitelist, shoot me
a message on Twitter or Discord. If you know me, you ought to know at
least one of those (or a different way to contact me).
</p>

<p>
If you know you have been whitelisted, you can go ahead and download
the modpack for import into MultiMC <a href="./files/modpack.zip">here</a>, which comes with the server
added to the servers list, or if you'd prefer to connect from a
vanilla 1.16.4 client, just add <code>mc.pea.sh</code>.
</p>
</div>
</div>
<div id="outline-container-orgd3fa996" class="outline-2">
<h2 id="orgd3fa996"><span class="section-number-2">2</span> Mods</h2>
<div class="outline-text-2" id="text-2">
<p>
No links for now, sorry, I'll add those later. For now the important
thing to know is that they're all either GPL, MIT, or in one case,
Public Domain.
</p>
</div>
<div id="outline-container-org3f1221b" class="outline-3">
<h3 id="org3f1221b"><span class="section-number-3">2.1</span> Client Only</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Dynamic FPS</li>
<li>LambDynamicLights</li>
<li>Litematica</li>
<li>MaLiLib</li>
<li>Mod Menu</li>
<li>Mouse Wheelie</li>
<li>Roughly Enough Items</li>
<li>Shulker Box Tooltip</li>
<li>Sodium</li>
</ul>
</div>
</div>
<div id="outline-container-org96f5666" class="outline-3">
<h3 id="org96f5666"><span class="section-number-3">2.2</span> Server Only</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Auto Backup</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc9e07c" class="outline-3">
<h3 id="orgcc9e07c"><span class="section-number-3">2.3</span> Both</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Fabric API</li>
<li>Carpet</li>
<li>Lithium</li>
<li>Phosphor</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-11-21 Sat 08:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
